In [1]:
import pandas as pd 
df1=pd.DataFrame({'calisanlar':['Ali','Veli','Ayse','Fatma'],
'grup':['Muhasebe','Muhendislik','Muhendislik','İK']})
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [4]:
df2=pd.DataFrame({'calisanlar':['Ayse','Ali','Veli','Fatma'],
'ilk_giris':[2010,2009,2014,2019]
})
df2

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [5]:
#merge fonksiyonu birleştirmenin hangi değişkene göre yapılacağını kenisi anlayabilir
pd.merge(df1,df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [3]:
#çoktan teke
df3=pd.merge(df1,df2)

NameError: name 'df2' is not defined

In [8]:
df4=pd.DataFrame({'grup':['Muhasebe','Muhendislik','İK'],
'mudur':['Caner','Mustafa','Berkcan']
})
df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           İK  Berkcan

In [9]:
pd.merge(df3,df4)

NameError: name 'df3' is not defined

In [10]:
#çoktan çoka
df5=pd.DataFrame({'grup':['Muhasebe','Muhasebe','Muhendislik','Muhendislik','İK','İK'],
'yetenekler':['matematik','excel','kodlama','linux','excel','yonetim']
})
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           İK      excel
5           İK    yonetim

In [11]:
pd.merge(df1,df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Muhendislik    kodlama
3       Veli  Muhendislik      linux
4       Ayse  Muhendislik    kodlama
5       Ayse  Muhendislik      linux
6      Fatma           İK      excel
7      Fatma           İK    yonetim

In [12]:
import seaborn as sns

c:\Users\akbul\anaconda3\lib\site-packages\scipy\__init__.py:146: UserWarning: A NumPy version >=1.16.5 and <1.23.0 is required for this version of SciPy (detected version 1.24.1
  warnings.warn(f"A NumPy version >={np_minversion} and <{np_maxversion}"

In [14]:
df=sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [15]:
df.size

6210

In [17]:
df.shape

(1035, 6)

In [18]:
df.ndim

2

In [20]:
df["mass"].count()#toplamı verir

513

In [22]:
df["mass"].max() #maxı verir

25.0

In [23]:
df.mean()

C:\Users\akbul\AppData\Local\Temp/ipykernel_14992/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [24]:
df["mass"].std()#standat sapmayı verir

3.8186166509616046

In [25]:
df["mass"].var()#varyansını verir

14.58183312700122